---
kind: field
id: F:Autodesk.Revit.DB.PointClouds.CloudPoint.Z
source: html/fbeaa68b-f16a-007f-4bd5-648bc597bb9e.htm
---
# Autodesk.Revit.DB.PointClouds.CloudPoint.Z Field

The Z coordinate

## Syntax (C#)
```csharp
public float Z
```